In [1]:
import pandas as pd

In [7]:
scores = {"name": ['Ray', 'Japhy', 'Zosa'],
          "city": ['San Francisco', 'San Francisco', 'Denver'],
          "score": [75, 92, 94]
          }

In [8]:
df = pd.DataFrame(scores)

In [9]:
df

    name           city  score
0    Ray  San Francisco     75
1  Japhy  San Francisco     92
2   Zosa         Denver     94

In [10]:
df['score']

0    75
1    92
2    94
Name: score, dtype: int64

In [14]:
df['name_city'] = df['name'] + '_' + df['city']

In [15]:
df[df['score']>90]

    name           city  score            name_city
1  Japhy  San Francisco     92  Japhy_San Francisco
2   Zosa         Denver     94          Zosa_Denver